In [1]:
%reload_ext autoreload
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [56]:
raw_data = pd.read_csv('../data/skill_builder_data.csv', encoding='latin-1', dtype='object')
print('Data shape', raw_data.shape)
print('Data keys', list(raw_data.keys()))
raw_data.head()

Data shape (525534, 30)
Data keys ['order_id', 'assignment_id', 'user_id', 'assistment_id', 'problem_id', 'original', 'correct', 'attempt_count', 'ms_first_response', 'tutor_mode', 'answer_type', 'sequence_id', 'student_class_id', 'position', 'type', 'base_sequence_id', 'skill_id', 'skill_name', 'teacher_id', 'school_id', 'hint_count', 'hint_total', 'overlap_time', 'template_id', 'answer_id', 'answer_text', 'first_action', 'bottom_hint', 'opportunity', 'opportunity_original']

,order_id,assignment_id,user_id,assistment_id,problem_id,original,correct,attempt_count,ms_first_response,tutor_mode,...,hint_count,hint_total,overlap_time,template_id,answer_id,answer_text,first_action,bottom_hint,opportunity,opportunity_original
0,33022537,277618,64525,33139,51424,1,1,1,32454,tutor,...,0,3,32454,30799,NaN,26,0,NaN,1,1
1,33022709,277618,64525,33150,51435,1,1,1,4922,tutor,...,0,3,4922,30799,NaN,55,0,NaN,2,2
2,35450204,220674,70363,33159,51444,1,0,2,25390,tutor,...,0,3,42000,30799,NaN,88,0,NaN,1,1
3,35450295,220674,70363,33110,51395,1,1,1,4859,tutor,...,0,3,4859,30059,NaN,41,0,NaN,2,2
4,35450311,220674,70363,33196,51481,1,0,14,19813,tutor,...,3,4,124564,30060,NaN,65,0,0,3,3

In [75]:
'skill_id', raw_data.groupby(['skill_id']).count()['order_id'].shape

('skill_id', (123,))

In [58]:
'user_id', raw_data.groupby(['user_id']).count()['order_id'].shape

('user_id', (4217,))

In [59]:
'assistment_id', raw_data.groupby(['assistment_id']).count()['order_id'].shape

('assistment_id', (17725,))

In [60]:
'problem_id', raw_data.groupby(['problem_id']).count()['order_id'].shape

('problem_id', (26688,))

In [61]:
'sequence_id', raw_data.groupby(['sequence_id']).count()['order_id'].shape

('sequence_id', (677,))

In [63]:
filter_data = raw_data[raw_data['assistment_id'] == '33139']
filter_data = filter_data[filter_data['user_id'] == '64525']
filter_data

,order_id,assignment_id,user_id,assistment_id,problem_id,original,correct,attempt_count,ms_first_response,tutor_mode,...,hint_count,hint_total,overlap_time,template_id,answer_id,answer_text,first_action,bottom_hint,opportunity,opportunity_original
0,33022537,277618,64525,33139,51424,1,1,1,32454,tutor,...,0,3,32454,30799,NaN,26,0,NaN,1,1
47611,33022537,277618,64525,33139,51424,1,1,1,32454,tutor,...,0,3,32454,30799,NaN,26,0,NaN,1,1

In [71]:
data = raw_data[['user_id', 'skill_id', 'correct']]
data = data[pd.notnull(data['skill_id'])]

In [72]:
data.head()

  user_id skill_id correct
0   64525        1       1
1   64525        1       1
2   70363        1       0
3   70363        1       1
4   70363        1       0

In [73]:
data.to_csv('../data/khan_ass.csv', index=False, header=False, sep=' ')

In [68]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525534 entries, 0 to 525533
Data columns (total 3 columns):
user_id     525534 non-null object
skill_id    459208 non-null object
correct     525534 non-null object
dtypes: object(3)
memory usage: 12.0+ MB

In [77]:
'skill_id', raw_data.groupby(['skill_id']).count()['user_id'].shape

('skill_id', (123,))